// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Skanna till dator";

// Restore alert message
"RESTORE_TITLE" = "Är det säkert att du vill återställa inställningarna?";
"RESTORE_MSG" = "Om du fortsätter kommer alla skanningsgenvägar att återställas till sin ursprungliga status. Tryck på Avbryt om du vill ha kvar genvägarna som de är eller på Återställ om du vill att genvägarna ska återta sina standardinställningar.";
"RESTORE_BUTTON_TITLE" = "Återställ";

"DEFAULT_TASK_CAPTION" = "Åtgärdsnamn:";
"DONE" = "Klar";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Åtgärden är inte tillgänglig";
"TASK_NOT_FOUND_DESC" = "Åtgärden \"%@\" som hittats på din enhet är inte tillgänglig i systemet. Välj en annan åtgärd.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Kopieringen av arbetsflöden misslyckades";
"COPY_WORKFLOWS_DESC" = "Lyckades inte kopiera arbetsflödena till domänmappen för användarenheter";

"DEVICE_NOT_FOUND_TITLE" = "Enheten hittades inte";
"DEVICE_NOT_FOUND_DESC" = "Det var problem med att kommunicera med enheten. Kontrollera att enheten är påslagen och korrekt ansluten och gör ett nytt försök.";

"COMPUTER_NAME_INFO_TITLE" = "I fältet \"Datornamn\" kan du ange ett namn för datorn som ska visas på HP-enheten."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "Enheten avgör hur många tecken du kan ange.";

"UNKNOWN_ERROR_TITLE" = "Okänt fel";
"UNKNOWN_ERROR_DESC" = "Ett okänt fel uppstod under uppdateringen av enheten. Kontrollera att enheten är påslagen och ansluten på rätt sätt.";

"OK" = "OK";
"CANCEL" = "Avbryt";

"MOREINFO_TITLE" = "Mer information";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Hantering av skanningsgenvägar"; // Title
"SSM_SHORT_DESC" = "Använd skanningsgenvägar om du vill utföra vanliga skanningsåtgärder med hjälp av kontrollerna på frontpanelen på din HP-enhet."; // short description
"YOUR_COMPUTER_NAME" = "Datornamn:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Ändra...";
"MORE_INFO_BTN_TITLE" = "Mer info...";
"RESTORE_BTN_TITLE" = "Återställ std.inst";
"TEST_BTN_TITLE" = "Testa...";
"EDIT_BTN_TITLE" = "Redigera...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "Du har inte rätt behörighet till mappen “%@”. Om du vill visa eller ändra behörighetsinställningarna väljer du objektet i Finder och väljer Arkiv > Visa info."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Fel";
"ERROR_UNKNOWN_DESC" = "Ett okänt fel har uppstått.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Hittar inte genvägen";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "Kunde inte hitta genvägen %1$@ för enheten %2$@. Prova med att installera om programvaran.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Arbetsflödet kunde inte skapas";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Ett okänt fel uppstod när arbetsflödet skulle skapas. Gör ett nytt försök.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Fel när en katalog skulle skapas";
"ERROR_CREATING_DIR_DESC" = "Ett fel uppstod när katalogen %@ skulle skapas. Kontrollera behörigheten till den överordnade mappen och försök igen";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Ett fel uppstod när arbetsflödet “%@” öppnades i Automator. Arbetsflödet fanns inte på den ursprungliga platsen";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Skanningsgenvägen stöds inte";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Den valda skanningsgenvägen kan inte tillämpas på grund av att programvaran inte känner igen den. Välj en annan skanningsgenväg och försök igen.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Klicka för att ändra datornamnet";
"TIP_FOR_EDIT_BTN" = "Redigera den valda uppgiften";
"TIP_FOR_TEST_BTN" = "Utför den valda uppgiften";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Datorns namn är";
"COMPUTER_NAME_DESCRIPTION" = "När du startar en skanning från din HP-enhet kan du bli ombedd att välja dator i en lista över värddatorer som är aktiverade för Skanna till dator.";
"COMPUTER" = "Dator";
"COMPUTERS" = "Datorer";

"COMMUNICATION_ERROR" = "Det går inte att upprätta någon kommunikation med skannern. Försäkra dig om att enheten är påslagen, kontrollera anslutningen och se till att nätverket fungerar som det ska. Observera att Bonjour måste vara aktiverat på enheten.";
"INSTALLATION_ERROR" = "Kan inte hitta den HP-programvara som är nödvändig för skanning till datorn på den här datorn. Ladda ned och installera den senaste HP-rekommenderade programvaran för enheten från http://www.hp.com/support och försök igen.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Skanna till dator kan inte aktiveras";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Med Skanna till dator startar du en skanning från HP-enhetens frontpanel och resultatet skickas automatiskt till din dator.";

HSDScanActionNotFoundTitle = "Kan inte hitta skanningsåtgärden";
HSDScanActionNotFoundDescription = "Skanningsåtgärden har inte registrerarts. Starta programmet HP Scan på '%@' för att registrera skanningsåtgärden automatiskt.";
